# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
#
# Пример:
#
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

if __name__ == "__main__":
    n = int(input('Введите число, которое хотите перевести в двоичную систему: '))
    print(bin)

    # b = ''
    # while n > 0:
    #     b = str(n % 2) + b
    #     n = n // 2
    # print(b)

